{
  "autonomous_state": {
    "current_spotify_playlist": "https://open.spotify.com/playlist/37i9dQZF1DX9wCBDkixAu6?si=1234567890",
    "chat_phase": "listening (active)",
    "notification_queue": {
      "Morgan": {
        "notifications": [
          {
            "intended_recipient": "Morgan",
            "notification_content": "📰 Tech News: OpenAI’s most capable AI model, GPT-5, may be coming in August\nOpenAI's upcoming GPT-5 model is generating excitement as it is poised to be released as early as Au...\nKey insights:\n• GPT-5 is set to unify OpenAI's various AI capabilities, indicating significant integration and enhancement over its predecessors.\n• The introduction of mini and nano versions suggests a strategic choice to offer scalable options for different use cases.",
            "relevant_when": "next_24_hours"
          },
          {
            "intended_recipient": "Morgan",
            "notification_content": "📰 Tech News: Meta's wristband breakthrough lets you use digital devices without touching them\nMeta's Reality Labs has introduced a groundbreaking wristband that can control digital devices throu...\nKey insights:\n• The wristband translates hand gestures into device commands without physical interaction.\n• Utilizes AI for pattern recognition, enhancing usability across different users.",
            "relevant_when": "next_24_hours"
          },
          {
            "intended_recipient": "Morgan",
            "notification_content": "📰 Tech News: AMD Confirms Ryzen Threadripper 9000 “HEDT” CPU Prices: Available on 31st July, $1499 For 24 Cores, $2499 For 32 Cores & $4999 For 64 Cores\nAMD's announcement of the Ryzen Threadripper 9000 series CPUs offers a range of high-performance pro...\nKey insights:\n• Introduction of Ryzen Threadripper 9000 CPUs with high core counts for HEDT enthusiasts.\n• Significant price reductions compared to previous models, enhancing accessibility for high-performance computing.",
            "relevant_when": "next_24_hours"
          },
          {
            "intended_recipient": "Morgan",
            "notification_content": "📰 Tech News: Google Might Have Made an AI Search Product I Actually Like\nGoogle's latest AI-powered feature, the Web Guide, is designed to improve search functionality by gr...\nKey insights:\n• Web Guide enhances the user experience by categorizing search results.\n• The feature offers a more intuitive approach to searching without summarizing content.",
            "relevant_when": "next_24_hours"
          }
        ]
      },
      "Spencer": {
        "notifications": []
      }
    }
  },
  "chat_controlled_state": {
    "current_spotify_user": "Spencer",
    "lighting_scene": "all_off"
  }
}